const List names =  [
{
'details ':
'   وهو الاسم الأعظم الذي تفرد به الحق سبحانه وخص به نفسه وجعله أول أسمائه، وأضافها كلها إليه فهو علم على ذاته سبحانه',
'name': 'اللهُ',
},

{
'details ':
' كثير الرحمة وهو اسم مقصور على الله عز وجل ولا يجوز أن يقال رحمن لغير الله، وذلك لأن رحمته وسعت كل شيء وهو أرحم الراحمين  ',
'name': 'الرَّحْمن',
},

{
'details ': ' هو المنعم أبدا، المتفضل دوما، فرحمته لا تنتهي',
'name': 'الرَّحِيم',
},
{
'details ':
' هو الله، ملك الملوك، له الملك، وهو مالك يوم الدين، ومليك الخلق فهو المالك المطلق',
'name': 'المَلِك',
},
{
'details ':
' هو الطاهر المنزه عن العيوب والنقائص وعن كل ما تحيط به العقول ',
'name': 'الْقُدُّوس',
},
{
'details ':
' هو ناشر السلام بين الأنام وهو الذي سلمت ذاته من النقص والعيب والفناء ',
'name': 'السَّلَام',
},
{
'details ': ' هو الذي سلم أوليائه من عذابه، والذي يصدق عباده ما وعدهم',
'name': 'المُؤْمِن',
},

{
'details ':
'هو الرقيب الحافظ لكل شيء، القائم على خلقه بأعمالهم، وأرزاقهم وآجالهم، والمطلع على خفايا الأمور وخبايا الصدور',
'name': 'الْمُهَيْمِن',
},
{
'details ':
'هو المنفرد بالعزة، الظاهر الذي لا يقهر، القوي الممتنع فلا يغلبه شيء وهو غالب كل شيء',
'name': 'الْعَزِيز',
},
{
'details ':
' هو الذي تنفذ مشيئته، ولا يخرج أحد عن تقديره، وهو القاهر لخلقه على ما أراد',
'name': 'الْجَبَّار',
},
{
'details ': ' هو المتعالى عن صفات الخلق المنفرد بالعظمة والكبرياء.',
'name': 'الْمُتَكَبِّر',
},
{
'details ':
'هو الفاطر المبدع لكل شيء، والمقدر له والموجد للأشياء من العدم، فهو خالق كل صانع وصنعته.',
'name': 'الْخَالِق',
},
{
'details ':
'هو الذي خلق الخلق بقدرته لا عن مثال سابق، القادر على إبراز ما قدره إلى الوجود',
'name': 'الْبَارِئ',
},
{
'details ':
'هو الذي صور جميع الموجودات، ورتبها فأعطى كل شيء منها صورة خاصة، وهيئة منفردة، يتميز بها على اختلافها وكثرتها',
'name': 'الْمُصَوِّر',
},
{
'details ': 'هو وحده الذي يغفر الذنوب ويستر العيوب في الدنيا والآخرة',
'name': 'اَلْغَفَّار',
},
{
'details ':
'هو الغالب الذي قهر خلقه بسلطانه وقدرته، وخضعت له الرقاب وذلت له الجبابرة، وصرف خلقه على ما أراد طوعا وكرها، وعنت الوجوه له',
'name': 'الْقَهَّار',
},
{
'details ':
'هو المنعم على العباد، الذي يهب بغير عوض ويعطي الحاجة بغير سؤال، كثير النعم، دائم العطاء',
'name': 'الْوَهَّاب',
},
{
'details ':
' هو الذي خلق الأرزاق وأعطى كل الخلائق أرزاقها، ويمد كل كائن لما يحتاجه، ويحفظ عليه حياته ويصلحه',
'name': 'الرَّزَّاق',
},

{
'details ':
' هو الذي يفتح مغلق الأمور، ويسهل العسير، وبيده مفاتيح السماوات والأرض',
'name': 'الْفَتَّاح',
},
{
'details ':
'هو الذي يعلم تفاصيل الأمور، ودقائق الأشياء وخفايا الضمائر، والنفوس، لا يعزب عنه مثقال ذرة، فعلمه يحيط بجميع الأشياء',
'name': 'الْعَلِيم',
},
{
'details ':
' هو الذي يقبض الرزق عمن يشاء من الخلق بعدله وحكمته، والذي يوسع الرزق لمن يشاء من عباده بجوده ورحمته فهو سبحانه القابض الباسط',
'name': 'الْقَابِضُ الْبَاسِطُ',
},
{
'details ':
'هو الذي يخفض الأذلال لكل من طغى وتجبر وخرج على شريعته وتمرد، وهو الذي يرفع عباده المؤمنين بالطاعات ويرفعهم على عدوهم فينصرهم وهو رافع السماوات السبع.',
'name': 'الخافض* الرَّافِعُ',
},
{
'details ':
'هو الذي يهب القوة والغلبة والشدة لمن شاء فيعزه، وينزعها عمن يشاء فيذله',
'name': 'المعز* المذل',
},
{
'details ':
'ومعناه سمعه لجميع الأصوات الظاهرة والباطنة الخفية والجلية، وإحاطته التامة بها، ومعناه أيضًا: سمع الإجابة منه للسائلين والداعين والعابدين فيجيبهم ويثيبهم',
'name': 'السَّمِيعُ',
},
{
'details ':
'هو الذي يرى الأشياء كلها ظاهرها وباطنها وهو المحيط بكل شيء علماً',
'name': 'الْبَصِير',
},
{
'details ':
'هو الذي يفصل بين مخلوقاته بما شاء ويفصل بين الحق والباطل لا راد لقضائه ولا معقب لحكمه',
'name': 'الْحَكَم',
},
{
'details ':
'هو الذي حرم الظلم على نفسه، وجعله على عباده محرما، فهو المنزه عن الظلم والجور في أحكامه وأفعاله الذي يعطي كل ذي حق حقه',
'name': 'العدل',
},

{
'details ':
'هو البر الرفيق بعباده، يرزق وييسر ويحسن إليهم، ويرفق بهم ويتفضل عليهم',
'name': 'اللَّطِيفُ',
},
{
'details ':
'هو العليم بدقائق الأمور، لا تخفى عليه خافية، ولا يغيب عن علمه شيء فهو العالم بما كان ويكون',
'name': 'الْخَبِيرُ',
},
{
'details ':
' هو الصبور الذي يمهل ولا يهمل، ويستر الذنوب، ويؤخر العقوبة، فيرزق العاصي كما يرزق المطيع',
'name': 'الْحَلِيمُ',
},
{
'details ':
'هو العظيم في كل شئ، عظيم في ذاته وأسمائه وصفاته، عظيم في رحمته، عظيم في قدرته، عظيم في حكمته، عظيم في جبروته وكبريائه، عظيم في هبته وعطائه، عظيم في خبرته ولطفه، عظيم في بره وإحسانه، عظيم في عزته وعدله وحمده، فهو العظيم المطلق، فلا أحد يساويه، ولاعظيم يدانيه',
'name': 'الْعَظِيمُ',
},

{
'details ':
'هو الساتر لذنوب عباده المتجاوز عن خطاياهم وذنوبهم. الفرق بين هذا الاسم واسم الغفار أن اسم الغفور يكون للدلالة على مغفرة الذنب مهما عظم وأيس صاحبه من المغفرة أما الغفار فتدل على مغفرة الله المستمرة للذنوب المختلفة لأن الإنسان خطاء فالله غفار',
'name': 'الْغَفُورُ',
},
{
'details ':
' هو الذي يزكو عنده القليل من أعمال العباد، فيتقبلها ويضاعف أجرها',
'name': 'الشَّكُورُ',
},

{
'details ':
'هو الرفيع القدر فلا يحيط به وصف الواصفين المتعالي عن الأنداد والأضداد، فكل معاني العلو ثابتة له ذاتا وقهرا وشأنا',
'name': 'الْعَلِيُّ',
},
{
'details ':
' هو العظيم الجليل ذو الكبرياء في صفاته وأفعاله فلا يحتاج إلى شيء ولا يعجزه شيء (ليس كمثله شيء)',
'name': 'الْكَبِيرُ',
},
{
'details ':
' هو الذي لا يغرب عن حفظه شيء ولو كمثقال الذر فحفظه لا يتبدل ولا يزول ولا يعتريه التبديل',
'name': 'الْحَفِيظُ',
},
{
'details ':
'هو المتكفل بإيصال أقوات الخلق إليهم وهو الحفيظ والمقتدر والقدير والمقدر والممدد',
'name': 'المُقِيت',
},

{
'details ':
'هو الكافي الذي منه كفاية العباد وهو الذي عليه الاعتماد يكفي العباد بفضله',
'name': 'الْحَسِيبُ',
},
{
'details ':
'هو العظيم المطلق المتصف بجميع صفات الكمال والمنعوت بكمالها المنزه عن كل نقص',
'name': 'الجليل',
},
{
'details ':
'هو الكثير الخير الجواد المعطي الذي لا ينفذ عطاؤه وهو الكريم المطلق الجامع لأنواع الخير والشرف والفضائل المحمود بفعاله',
'name': 'الْكَرِيمُ',
},

{
'details ':
'هو الرقيب الذي يراقب أحوال العباد ويعلم أقوالهم ويحصي أعمالهم وهو الحافظ الذي لا يغيب عنه شيء',
'name': 'الرَّقِيبُ',
},

{
'details ':
'هو الذي يجيب دعاء من دعاه، وسؤال من سأله، ويقابله بالعطاء والقبول، ولا يسأل أحد سواه',
'name': 'الْمُجِيبُ',
},
{
'details ':
'هو الذي وسع رزقه جميع خلقه، وسعت رحمته كل شيء المحيط بكل شيء',
'name': 'الْوَاسِعُ',
},

{
'details ':
'هو المحق في تدبيره اللطيف في تقديره الخبير بحقائق الأمور العليم بحكمه المقدور فجميع خلقه وقضاه خير وحكمة وعدل',
'name': 'اَلْحَكِيمُ',
},

{
'details ': 'هو المحب لعباده، والمحبوب في قلوب أوليائه',
'name': 'الْوَدُودُ',
},

{
'details ':
'هو الله تمجَّد بفعاله، ومجَّده خلقه لعظمته، والمجيد هو واسع الكرم، ووصف نفسه بالمجيد وهو متضمن كثرة صفات كماله وسعتها، وعدم إحصاء الخلق لها، وسعة أفعاله وكثرة خيره ودوامه. وتعني أيضاً البالغ النهاية في المجد، الكثير الإحسان الجزيل العطاء العظيم البر. تمجد',
'name': 'الْمَجِيدُ',
},

{
'details ':
'هو باعث الخلق يوم القيامة، وباعث رسله إلى العباد، وباعث المعونة إلى العبد',
'name': 'الباعث',
},

{
'details ':
'هو الحاضر الذي لا يغيب عنه شيء، فهو المطلع على كل شيء مشاهد له عليم بتفاصيله',
'name': 'الشَّهِيدُ',
},

{
'details ': 'هو الذي يحق الحق بكلماته ويؤيد أولياءه فهو المستحق للعبادة',
'name': 'الْحَقُّ',
},
{
'details ':
'هو الكفيل بالخلق القائم بأمورهم فمن توكل عليه تولاه وكفاه، ومن استغنى به أغناه وأرضاه',
'name': 'الْوَكِيلُ',
},
{
'details ':
'هو صاحب القدرة التامة البالغة الكمال غالب لا يُغلب فقوته فوق كل قوة، ولايرد قضاءه راد، ينفذ أمره، ويمضي قضاؤه في خلقه، شديد عقابه لمن كفر بآياته وجحد حججه',
'name': 'الْقَوِيّ',
},
{
'details ':
'هو الشديد الذي لا يحتاج في إمضاء حكمه إلى جند أو مدد ولا إلى معين، فهو المتناهي في القوة، التي لاتلحق أفعاله مشقة، ولايمسه فيها لغوب',
'name': 'الْمَتِينُ',
},
{
'details ':
'هو المحب الناصر لمن أطاعه، ينصر أولياءه، ويقهر أعداءه، والمتولي الأمور الخلائق ويحفظهم',
'name': 'الْوَلِيُّ',
},

{
'details ':
'هو المستحق للحمد والثناء له منتهى الحمد وأطيبه على ذاته وصفاته وعلى نعمه التي لا تحصى',
'name': 'الْحَمِيدُ',
},
{
'details ': 'هو الذي أحصى كل شيء بعلمه، فلا يفوته منها دقيق ولا جليل',
'name': 'الْـمُحْصِي',
},
{
'details ': 'هو الذي أنشأ الأشياء، واخترعها ابتداء من غير سابق مثال',
'name': 'المبدئ',
},
{
'details ':
'هو الذي يعيد الخلق بعد الحياة إلى الممات في الدنيا، وبعد الممات إلى الحياة يوم القيامة',
'name': 'المعيد',
},
{
'details ':
'هو خالق الحياة ومعطيها لمن شاء، يحيي الخلق من العدم ثم يحييهم بعد الموت',
'name': 'المُحيي',
},
{
'details ':
'هو مقدر الموت على كل من أماته ولا مميت سواه، قهر عباده بالموت متى شاء وكيف شاء',
'name': 'المميت',
},

{
'details ':
'هو المتصف بالحياة الأبدية التي لا بداية لها ولا نهاية فهو الباقي أزلا وأبدا وهو الحي الذي لا يموت',
'name': 'الْحَيُّ',
},
{
'details ':
'هو القائم بنفسه، الغني عن غيره، وهو القائم بتدبير أمر خلقه في إنشائهم ورزقهم',
'name': 'الْقَيُّومُ',
},
{
'details ':
'هو الذي لا يعوزه شيء ولا يعجزه شيء يجد كل ما يطلبه، ويدرك كل ما يريده',
'name': 'الواجد',
},
{
'details ':
'هو الذي له الكمال المتناهي والعز الباهي، له العز في الأوصاف والأفعال الذي يعامل العباد بالجود والرحمة',
'name': 'الماجد',
},

{
'details ':
'هو الفرد المتفرد في ذاته وصفائه وأفعاله، واحد في ملكه لا ينازعه أحد، لا شريك له سبحانه',
'name': 'الْوَاحِدُ',
},

{
'details ':
'هو المطاع الذي لا يقضى دونه أمر، الذي يقصد إليه في الحوائج فهو مقصد عباده في مهمات دينهم ودنياهم',
'name': 'الصَّمَدُ',
},
{
'details ':
'هو الذي يقدر على إيجاد المعدوم وإعدام الموجود على قدر ما تقتضي الحكمة، لا زائدا عليه ولا ناقصا عنه',
'name': 'الْقَادِرُ',
},
{
'details ': ' هو الذي يقدر على إصلاح الخلائق على وجه لا يقدر عليه غيره',
'name': 'الْمُقْتَدِرُ',
},

{
'details ':
'هو الذي يقدم الأشياء ويضعها في مواضعها، فمن استحق التقديم قدمه',
'name': 'الْمُقَدِّمُ',
},

{
'details ':
'هو الذي يؤخر الأشياء فيضعها في مواضعها المؤخر لمن شاء من الفجار والكفار وكل من يستحق التأخير',
'name': 'الْمُؤَخِّرُ',
},
{
'details ': 'هو الذي لم يسبقه في الوجود شيء فهو أول قبل الوجود',
'name': 'الْأَوَّلُ',
},
{
'details ':
'هو الباقي بعد فناء خلقه، البقاء الأبدي يفنى الكل وله البقاء وحده، فليس بعده شيء',
'name': 'الْآخِرُ',
},
{
'details ':
'هو الذي ظهر فوق كل شيء وعلا عليه، الظاهر وجوده لكثرة دلائله',
'name': 'الظَّاهِرُ',
},
{
'details ':
'هو العالم ببواطن الأمور وخفاياها، وهو أقرب إلينا من حبل الوريد',
'name': 'الْبَاطِنُ',
},
{
'details ':
'هو المالك للأشياء المتصرف فيها بمشيئته وحكمته، ينفذ فيها أمره، ويجري عليها حكمه',
'name': 'الوالي',
},
{
'details ': ' هو الذي جل عن إفك المفترين، وتنزه عن وساوس المتحيرين',
'name': 'الْمُتَعَالِ',
},
{
'details ':
'هو العطوف على عباده ببره ولطفه، ومن على السائلين بحسن عطائه، وهو الصدق فيما وعد',
'name': 'الْبَرُّ',
},
{
'details ':
'هو الذي يوفق عباده للتوبة حتى يتوب عليهم ويقبل توبتهم فيقابل الدعاء بالعطاء، والتوبة بغفران الذنوب',
'name': 'التَّوَّابُ',
},

{
'details ':
'هو الذي يقصم ظهور الطغاة، ويشدد العقوبة على العصاة، وذلك بعد الإعذار والإنذار',
'name': 'الْمُنْتَقِمُ',
},

{
'details ':
'هو الذي يقصم ظهور الطغاة، ويشدد العقوبة على العصاة، وذلك بعد الإعذار والإنذار',
'name': 'الْمُنْتَقِمُ',
},

{
'details ':
'هو الذي يترك المؤاخدة على الذنوب ولا يذكرك بالعيوب فهو يمحو السيئات ويتجاوز عن المعاصي',
'name': 'العَفُو',
},
{
'details ':
'هو المتعطف على المذنبين بالتوبة، الذي جاد بلطفه ومن بتعطفه، يستر العيوب ثم يعفو عنها',
'name': 'الرَّؤُوفُ',
},
{
'details ': 'هو المتصرف في ملكه كيف يشاء لا راد لحكمه، ولا معقب لأمره',
'name': 'مَالِكُ الْمُلْكِ',
},
{
'details ':
'هو المنفرد بصفات الجلال والكمال والعظمة، المختص بالإكرام والكرامة وهو أهل لأن يجل',
'name': 'ذُو الْجَلَالِ والْإكْرَامِ',
},
{
'details ':
'هو العادل في حكمه، الذي ينتصف للمظلوم من الظالم، ثم يكمل عدله فيرضي الظالم بعد إرضاء المظلوم',
'name': 'المقسط',
},
{
'details ':
'هو الذي جمع الكمالات كلها، ذاتا ووصفا وفعلا، الذي يجمع بين الخلائق المتماثلة والمتباينة، والذي يجمع الأولين والآخرين',
'name': 'الْجَامِعُ',
},

{
'details ':
'هو الذي لا يحتاج إلى شيء، وهو المستغني عن كل ما سواه، المفتقر إليه كل من عاداه',
'name': 'الْغَنِيُّ',
},
{
'details ':
'هو معطي الغنى لعباده، يغني من يشاء غناه، وهو الكافي لمن شاء من عباده',
'name': 'المغني',
},
{
'details ':
'هو الذي أعطى كل شيء، ويمنع العطاء عن من يشاء ابتلاء أو حماية',
'name': 'الْمُعْطِي المانع',
},
{
'details ':
'هو المقدر للضر على من أراد كيف أراد، والمقدر النفع والخير لمن أراد كيف أراد كل ذلك على مقتضى حكمته سبحانه',
'name': 'الضار* النافع',
},

{
'details ':
' هو الهادي الرشيد الذي يرشد بهدايته من يشاء فيبين له الحق، ويلهمه اتباعه، الظاهر في ذاته، المظهر لغيره',
'name': 'النُّورُ',
},
{
'details ':
'هو المبين للخلق طريق الحق بكلامه يهدي القلوب إلى معرفته، والنفوس إلى طاعته',
'name': 'الْهَادِي',
},
{
'details ':
'هو الذي لا يماثله أحد في صفاته ولا في حكم من أحكامه، أو أمر من أموره، فهو المحدث الموجد على غير مثال',
'name': 'الْبَدِيعُ',
},
{
'details ':
'هو وحده له البقاء، الدائم الوجود الموصوف بالبقاء الأزلي، غير قابل للفناء فهو الباقي بلا انتهاء',
'name': 'الباقي',
},
{
'details ':
'هو الأبقى الدائم الذي يرث الخلائق بعد فناء الخلق، وهو يرث الأرض ومن عليها',
'name': 'الْوَارِثُ',
},
{
'details ':
'هو الذي أسعد من شاء بإرشاده، وأشقى من شاء بإبعاده، عظيم الحكمة بالغ الرشاد',
'name': 'الرشيد',
},
{
'details ': 'هو الحليم الذي لا يعاجل العصاة بالنقمة، بل يعفوا ويؤخر، ولا يسرع بالفعل قبل أوانه',
'name': 'الصبور',
},
] ;